#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/BrynardSecurity/dev-us-east-2/runs/run-nHNUKH8uXS7EFiMR

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-033606a2189aad1f7]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0]: Refreshing state... [id=tgw-0a741ca0e0caabc59]
module.vpc.aws_customer_gateway.this["IP1"]: Refreshing state... [id=cgw-0e016545cf746d233]
module.dev-us-east-2-tgw.aws_ram_resource_share.this[0]: Refreshing state... [id=arn:aws:ram:us-east-2:600252898040:resource-share/88b8dd8b-a65e-45c7-828f-15494c59bd38]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08958a3c4251d8ddf]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0]: Refreshing state... [id=tgw-rtb-0940689ec54c2a487]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"]: Refreshing state... [id=tgw-rtb-093753ec7f5fe8d08,Name]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Purpose"]: Refreshing state... [id=tgw-rtb-093753ec7f5fe8d08,Purpose]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0302be988e72f89f0]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-010fd84c70f3b0dcf]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-005c4753b67c9d6da]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0158358e8c9a77d9e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e4747d20c0b7d5e6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02231087b2801538b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-078f89e10f69bbd50]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cb0a2591163be52e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ad4ae5d52631afbb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09fa093c5c37e63e0]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0699f37f30cf37a1f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e5ebb395362fe6]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a7236ea212f7ca5e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0817e602ebc795795]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d6e52782d4ea08d6]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"]: Refreshing state... [id=tgw-attach-05ff77d0227188a23]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d9d2c9b90aa6aa64]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07784ad187c002f9d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e47225ebf899ea9c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09fa093c5c37e63e01080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01d6ed61c461293a4]
module.vpn-gateway.aws_vpn_connection.default[0]: Refreshing state... [id=vpn-095666446944ea2c8]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[0]: Refreshing state... [id=vgw-0699f37f30cf37a1f_rtb-0e4747d20c0b7d5e6]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[1]: Refreshing state... [id=vgw-0699f37f30cf37a1f_rtb-0e4747d20c0b7d5e6]
module.vpn-gateway.aws_vpn_gateway_route_propagation.private_subnets_vpn_routing[2]: Refreshing state... [id=vgw-0699f37f30cf37a1f_rtb-0e4747d20c0b7d5e6]
module.vpn-gateway.aws_vpn_gateway_attachment.default[0]: Refreshing state... [id=vpn-attachment-81d873f5]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e4747d20c0b7d5e61080289494]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route.this[0]: Refreshing state... [id=tgw-rtb-0940689ec54c2a487_10.9.0.0/16]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_default_route_table.default[0] has been changed
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0302be988e72f89f0"
      + propagating_vgws       = []
        tags                   = {
            "DefaultRouteTable" = "true"
            "Name"              = "dev-us-east-2-2021-12-07"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0f85b6a071883d9c1"
        id                   = "eipalloc-08958a3c4251d8ddf"
      + network_interface    = "eni-009e9dc90be4bca96"
      + private_dns          = "ip-10-9-11-185.us-east-2.compute.internal"
      + private_ip           = "10.9.11.185"
        tags                 = {
            "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        }
        # (8 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-09fa093c5c37e63e0"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-030e5ebb395362fe6"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-east-2-2021-12-07-public"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e4747d20c0b7d5e6"
      ~ propagating_vgws = [
          + "vgw-0699f37f30cf37a1f",
        ]
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-01d6ed61c461293a4"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-east-2-2021-12-07-private"
        }
        # (4 unchanged attributes hidden)
    }
  # module.vpn-gateway.aws_vpn_connection.default[0] has been changed
  ~ resource "aws_vpn_connection" "default" {
        id                                   = "vpn-095666446944ea2c8"
        tags                                 = {
            "Name" = "VPN Connection between VPC vpc-033606a2189aad1f7 and Customer Gateway cgw-0e016545cf746d233"
        }
      + tunnel1_ike_versions                 = []
      + tunnel1_phase1_dh_group_numbers      = []
      + tunnel1_phase1_encryption_algorithms = []
      + tunnel1_phase1_integrity_algorithms  = []
      + tunnel1_phase2_dh_group_numbers      = []
      + tunnel1_phase2_encryption_algorithms = []
      + tunnel1_phase2_integrity_algorithms  = []
      + tunnel2_ike_versions                 = []
      + tunnel2_phase1_dh_group_numbers      = []
      + tunnel2_phase1_encryption_algorithms = []
      + tunnel2_phase1_integrity_algorithms  = []
      + tunnel2_phase2_dh_group_numbers      = []
      + tunnel2_phase2_encryption_algorithms = []
      + tunnel2_phase2_integrity_algorithms  = []
        # (39 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"] will be updated in-place
  ~ resource "aws_ec2_tag" "this" {
        id          = "tgw-rtb-093753ec7f5fe8d08,Name"
      ~ value       = "dev-us-east-2-tgw-2021-12-07" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway" "this" {
        id                                 = "tgw-0a741ca0e0caabc59"
      ~ tags                               = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                           = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_route_table" "this" {
        id                              = "tgw-rtb-0940689ec54c2a487"
      ~ tags                            = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
        id                                              = "tgw-attach-05ff77d0227188a23"
      ~ tags                                            = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                                        = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ram_resource_association.this[0] will be created
  + resource "aws_ram_resource_association" "this" {
      + id                 = (known after apply)
      + resource_arn       = "arn:aws:ec2:us-east-2:600252898040:transit-gateway/tgw-0a741ca0e0caabc59"
      + resource_share_arn = "arn:aws:ram:us-east-2:600252898040:resource-share/88b8dd8b-a65e-45c7-828f-15494c59bd38"
    }

  # module.dev-us-east-2-tgw.aws_ram_resource_share.this[0] will be updated in-place
  ~ resource "aws_ram_resource_share" "this" {
        id                        = "arn:aws:ram:us-east-2:600252898040:resource-share/88b8dd8b-a65e-45c7-828f-15494c59bd38"
      ~ name                      = "dev-us-east-2-tgw-2021-12-07" -> (known after apply)
      ~ tags                      = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                  = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_customer_gateway.this["IP1"] will be updated in-place
  ~ resource "aws_customer_gateway" "this" {
        id          = "cgw-0e016545cf746d233"
      ~ tags        = {
          - "Name" = "dev-us-east-2-2021-12-07-IP1"
        } -> (known after apply)
      ~ tags_all    = {
          - "Name" = "dev-us-east-2-2021-12-07-IP1"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0302be988e72f89f0"
      ~ tags                   = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all               = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-08958a3c4251d8ddf"
      ~ tags                 = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-030e5ebb395362fe6"
      ~ tags     = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-01d6ed61c461293a4"
      ~ tags                 = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e4747d20c0b7d5e6"
      ~ tags             = {
          - "Name" = "dev-us-east-2-2021-12-07-private"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-east-2-2021-12-07-private"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-09fa093c5c37e63e0"
      ~ tags             = {
          - "Name" = "dev-us-east-2-2021-12-07-public"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-east-2-2021-12-07-public"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-02231087b2801538b"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0cb0a2591163be52e"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-005c4753b67c9d6da"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-078f89e10f69bbd50"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0ad4ae5d52631afbb"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0158358e8c9a77d9e"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-033606a2189aad1f7"
      ~ tags                             = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all                         = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpn_gateway.this[0] will be updated in-place
  ~ resource "aws_vpn_gateway" "this" {
        id              = "vgw-0699f37f30cf37a1f"
      ~ tags            = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all        = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 20 to change, 0 to destroy.


```

</details>

*Pusher: @RalphBrynard, Action: `pull_request`*